---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.RoomFailures.RoomNotEnclosedSpaces
source: html/47cec0d1-b41d-5c79-8c64-be8a4b375647.htm
---
# Autodesk.Revit.DB.BuiltInFailures.RoomFailures.RoomNotEnclosedSpaces Property

[Room] is not in a properly enclosed region

## Syntax (C#)
```csharp
public static FailureDefinitionId RoomNotEnclosedSpaces { get; }
```